package day02; // 현재 파일이 위치한 패키지의 이름을 명시

public class Test02 { //클래스

	public static void main(String[] args) { //메서드
		/*
		 * 
		 * public : 접근지정자 : 완전공개 ~ 나중에 
		 * class  : 클래스 만들때 사용하는 키워드 자바는 클래스들로 구성되어있다. 자바의 최소단위
		 * 			클래스 바깥에는 코드 작성 x
		 * Test04 : 클래스 이름 : 첫글자 대문자로 만들어야함 (변수와 구분하기 위해)
		 * 			>> 이클립스에서 파일생성시 name에 이름작성하면 이것이 클래스 이름이 되고, 파일생성시
		 * 			   첫글자 대문자로 작성.
		 * 				클래스 명명규칙 : 첫글자 대문자, 띄어쓰기 x, 한글 x
		 * 									특수기호 _, $ 만 가능, 키워드 x 대소문자 구분
		 * 									패키지 안에서는 같은이름의 클래스가 있을 수 없다.
		 * 
		 * static : 전역키워드 : 나중에 
		 * void   : 리턴타입 중 리턴할 값 없다! 
		 * main   : 메서드 이름 메인메서드는 프로그램이 시작되면 가장먼저 자동으로 실행되는 메서드.
		 * 			메인메서드가 종료되면 프로그램도 종료가 된다.
		 * 			프로그램내에 반드시 하나만 존재해야함.
		 * 
		 * String[] args : 매개변수 
		 * 
		 * 
		 * 
		 * 
		 */
	}

}
